from aiogram.types import Message

about_message='''Обучение состоит из 3-х блоков с теорией и заданиями.

Лучше всего, если за раз ты будешь выполнять один блок, а на следующий день начнёшь новый. Так обучение будет равномерным и займёт три дня. Но в любом случае я дам тебе возможность перейти к следующему заданию в любое время, когда тебе будет удобно.

После старта я отправлю тебе ссылку на онлайн-библиотеку, в которую отобрала самые лучшие книги по саморазвитию. Сейчас там находится более трёхсот книг и постепенно их количество будет увеличиваться. Доступ к библиотеке у тебя останется даже после окончания курса 😉


*ЗА 3 ДНЯ ТЫ НАУЧИШЬСЯ:*

⚡️ Осознанно выбирать книги для решения конкретных проблем

⚡️ Получать нужную информацию быстрее, чем раньше

⚡️ Извлекать главную суть из книг

⚡️ Лучше запоминать прочитанное

⚡️ Эффективно читать книги и применять инсайты для улучшения своей жизни

⚡️ Правильно подготавливать пространство, чтобы ничего не отвлекало'''

book_message='''По [этой ссылке](https://disk.yandex.ru/i/eIeFlsvBjMnANQ) ты можешь посмотреть список книг в моей библиотеке. Со временем их количество будет увеличиваться.
    
Если тебе нужна определённая книга, которой нет в библиотеке, напиши [мне в личные сообщения](http://t.me/sova_mudrosti) и я постараюсь её добавить ❤️'''

gift_message='''Держи свой подарок 😊

Этот чек-лист поможет тебе лучше высыпаться 😴 и вставать полным бодрости и энергии.'''

howtostart_title='Эффективное чтение'

howtostart_description='''Чтобы приступить к обучению, нужно произвести оплату 💵
  
После этого я пришлю тебе ссылку на онлайн-библиотеку и первый урок.
 
Сейчас доступна оплата только гражданам РФ, чтобы оплатить другим способом обратись ко мне в личные сообщения.'''

task1_message='''Спасибо, что ценишь мой труд.

📎 *ССЫЛКА НА ОНЛАЙН-БИБЛИОТЕКУ:*
https://disk.yandex.ru/d/sCV172ItQz2dhg?w=1

Доступ к ней останется навсегда. А теперь приступим к обучению 😊


💡 *УРОК 1: ВЫБОР КНИГ*

Всё начинается с осознанности.

Чтобы правильно выбрать книгу для чтения, тебе нужно чётко сформулировать свой запрос и ответить на вопрос «зачем?».

Далее будет идти речь только о книгах в жанре нон-фикшн и большинство практик не подойдёт для художественной литературы.

Вся наша жизнь состоит из пяти сфер: здоровье, финансы, развитие, окружение и отдых (досуг).

Большинство людей выбирает книги, основываясь на рекламе или советах других людей. Эффективное чтение предполагает иной подход. Проанализируй все пять сфер своей жизни и определи те проблемы, которые необходимо решить, расставь их по приоритету и найди подходящие книги из моей библиотеки. Таким образом у тебя появится конкретный запрос и мотивация быстрее приступить к чтению, которая не пропадёт, пока ты не получишь ответ и не решишь проблему.

Для удобства в библиотеке книги разложены по папкам. Каждая книга находится там не просто так. Ты можешь не сомневаться в её пользе.

Только ответив на вопрос «зачем?» можно приступать к чтению.



*10 САМЫХ ПОЛЕЗНЫХ КНИГ НА ВСЕ СЛУЧАИ ЖИЗНИ:*

1️⃣ Сам себе финансист (Анастасия Тарасова)

2️⃣ Хочу и буду (М. Лабковский)

3️⃣ Магия утра (Хэл Элрод)

4️⃣ 52 понедельника (Вик Джонсон)

5️⃣ Исцели свою жизнь (Луиза Хей)

6️⃣ 100 способов изменить свою жизнь (Лариса Парфентьева)

7️⃣ 7 навыков высокоэффективных людей (Стивен Кови)

8️⃣ Атомные привычки (Джеймс Клир)

9️⃣ Выйди из зоны комфорта (Брайн Трейси)

🔟 Самый богатый человек в Вавилоне (Джордж Клейсон)



*ЗАДАНИЕ 1: ВЫБОР КНИГ*

⚡️ Проанализируй 5 сфер своей жизни и выпиши для каждой вопросы (проблемы), которые нужно решить. Если с какой-то сферой у тебя всё в порядке, просто пропусти её.

⚡️ Ознакомься с библиотекой и выбери 2-3 книги для каждой сферы, которые по твоему мнению могут помочь.


Чтобы получить новое задание, обязательно нажми на кнопку👇🏻 '''

task2_message='''💡 *УРОК 2: ОТБОР КНИГ*

После того как книги прошли первичную проверку по тематике, тебе необходимо отфильтровать их по содержанию.

На данном этапе главная задача — понять, что написано в книгах и где находится эта информация.

Обрати внимание, сколько воды в книгах, а сколько полезного и нового. Почти любая книга жанра нон-фикшен состоит на треть из рассказов о личной жизни автора, многочисленных примеров, биографических справок и второстепенных деталей.

Смело отбрасывай те книги, которые не понравились сразу: первое впечатление, скорее всего, не обманывает. Если книга действительно полезная и важная, ты ещё с ней встретишься.



*СОВЕТЫ ИЗ ЛИЧНОГО ОПЫТА*

1️⃣ Не обязательно читать книги от корки до корки. Совсем неважно, сколько времени потрачено на чтение и сколько листов осилено.

2️⃣ Не пытайся запомнить всё, что прочитал. Главная цель — извлекать информацию по мере надобности, а не знать всё наизусть.

3️⃣ Не принуждай себя к чтению. Не читай потому что надо, читай потому что хочется.

4️⃣ Если ты отвык долго сосредотачиваться на чём-то, найди потенциально интересную книгу, убери все раздражители (телефон, людей, компьютер, источники шума) и просто попробуй действительно читать, не отвлекаясь хотя бы полчаса.

5️⃣ Чтобы сосредоточиться на чтении, тебе нужно подготовить пространство вокруг себя: убраться в комнате, исключить весь визуальный шум и бардак, сделать хорошее освещение. Можно читать с нейтральным фоновым шумом. Под стук колес поезда, звуки дождя, потрескивания костра, музыку для чтения или классику.

6️⃣ Чтобы чтение стало ежедневной привычкой, можешь использовать аромасвечу и со временем её запах будет служить спусковым крючком для её запуска.

7️⃣ Конспектируй. Если нашёл для себя полезную мысль, сразу выдели её и выпиши в заметки. После прочтения книги, всегда перечитывай свои пометки, чтобы освежить в памяти темы, которые показались важными.

8️⃣ Применяй на практике. Даже полностью прочитанная, усвоенная и законспектированная книга не несёт никакой пользы. Польза появляется в тот момент, когда ты применил знания на практике.

9️⃣ Ты можешь читать несколько книг параллельно. В этом нет ничего плохого. Если устал от одной книги, смена темы поможет тебе не утратить интерес к чтению. Обязательно читай параллельно с книгами по саморазвитию классическую художественную литературу.



*ЗАДАНИЕ 2: ОТБОР КНИГ*

⚡️ Пролистай по порядку вчерашние выбранные книги, прочти названия глав, заголовки, врезки, постарайся ухватить основной смысл каждой главы. Прочти обязательно всё, что выделено жирным шрифтом, просмотри таблички и списки.

⚡️ Отсей книги, которые тебе не понравились или показались скучными. Оставь по одной-две книги для каждой сферы, с которыми будешь работать дальше.'''

task3_message='''💡 *УРОК 3: ЭФФЕКТИВНОЕ ЧТЕНИЕ*

Ты наверное считаешь, что нужно читать книги строго от начала до конца, по порядку глав. Это заблуждение для книг жанра нон-фикшн. У многих людей присутствует чувство стыда или страх упустить что-то важное в книге и они тратят неоправданно много времени на чтение бесполезной информации. Если ты замечаешь в себе подобное поведение, то попытайся перебороть его. Ведь если читать все книги подряд от корки до корки, на это уйдёт слишком много времени и твоя мотивация вскоре угаснет.

Чтобы этого не произошло, тебе нужно читать по главам. Выбирай для чтения только те главы, в которых ты думаешь кроются ответы на твои вопросы, которые тебя особенно привлекли и несут в себе самую интересную и важную информацию. Концентрируй внимание на основных идеях, мыслях, советах, старайся добраться до сути.

После прочитанного выписывай инсайты из книг. Это проще делать в заметках телефона. Копируй основные мысли, инсайты, цитаты. Всё, что посчитаешь нужным. И после полного прочтения книги вернись к заметкам и освежи память. Чтобы эффект был ещё сильнее, постарайся на следующий день написать своими словами, всё что ты смог запомнить из прочитанного. Делая так на регулярной основе, ты укрепишь память и запустишь процесс нейрогенеза — образования новых нейронных связей в головном мозге.

После того, как прочитаешь все интересующие тебя главы в каждой книге, оцени её по 10-балльной шкале и укажи плюсы и минусы.

Оценка создаёт определённый ярлык в сознании. Только она и твой отзыв — это ✔️ «галочка», которая говорит, что ты знаком с книгой, теперь она для тебя не чужая.



*ЗАДАНИЕ 3: ЭФФЕКТИВНОЕ ЧТЕНИЕ*

⚡️ Выбери первую книгу по приоритету и начни читать её по главам.

⚡️ Выпиши из неё инсайты в отдельный блокнот или заметки.

⚡️ Через несколько часов после чтения постарайся написать своими словами все мысли из книги, которые отложились в твоей памяти.

⚡️ Оцени книгу по 10-балльной шкале и укажи её плюсы и минусы.

⚡️ Обязательно примени в жизни хотя бы один инсайт из книги в течение следующих трёх дней, иначе чтение было бесполезным.'''

gift2_message='''*ПОЗДРАВЛЯЮ С ПРОХОЖДЕНИЕМ!*

Я привыкла всегда отдавать больше, чем мне за это платят, поэтому у меня есть для тебя ещё один подарок.

_Не удаляй этого бота, я обещаю не надоедать тебе частыми сообщениями и рекламой. Буду присылать тебе только самую интересную и обучающую информацию по саморазвитию._'''

gift2_caption='''*Вот держи* 🤗

Если применишь все правила отсюда, то гарантированно сможешь улучшить своё финансовое положение.'''

MESSAGES = {
    'about': about_message,
    'book': book_message,
    'gift': gift_message,
    'title': howtostart_title,
    'description': howtostart_description,
    'task1': task1_message,
    'task2': task2_message,
    'task3': task3_message,
    'gift2': gift2_message,
    'gift_caption': gift2_caption

}